app/Http/Controllers/Api/APIController.php

    public function login(ApiLoginRequest $request){
        $request->validated($request->all());

        if(!Auth::attempt($request->only("email","password"))){
            return $this->error("Invalid Credentials", 401);
        }

        $user = User::firstWhere("email", $request->email);
---
select * from `users` where `email` = 'hroob@example.com' limit 1