app/Http/Controllers/Api/V1/TicketController.php

select * from `tickets` limit 15 offset 0
select count(*) as aggregate from `tickets`
---
    public function index(TicketFilter $filters)
    {
        /* if ($this->include('author')){
            return TicketResource::collection(Ticket::with('user')->paginate());
        }  */
        // $filters->status($value);
        return TicketResource::collection(Ticket::filter($filters)->paginate());

select * from `users` where `users`.`id` = 9 limit 1
insert into `tickets` (`title`, `description`, `status`, `user_id`, `updated_at`, `created_at`) values ('First Ticket', 'This is my first ticket', 'A', 9, '2025-11-04 10:26:23', '2025-11-04 10:26:23')
---
    public function store(StoreTicketRequest $request)
    {
        try{
            $user = User::findorFail($request->input('data.relationships.author.data.id'));
        }catch(ModelNotFoundException $exception){
            return $this->error('User not found!', [
                "error" => "The provided user id doesn't exist"
            ]);
        }
        $model = [
            'title' => $request->input('data.attributes.title'),
            'description' => $request->input('data.attributes.description'),
            'status' => $request->input('data.attributes.status'),
            'user_id' => $request->input('data.relationships.author.data.id'),
        ];
        return new TicketResource(Ticket::create($model));

select * from `tickets` where `tickets`.`id` = '3' limit 1
---
    public function show($ticket_id)
    {
        try{
            $ticket = Ticket::findorFail($ticket_id);

select * from `tickets` where `tickets`.`id` = '4' limit 1
update `tickets` set `title` = 'First Ticket', `description` = 'This is my first ticket', `status` = 'A', `tickets`.`updated_at` = '2025-11-04 10:29:00' where `id` = 4
---
    public function edit(EditTicketRequest $request, $ticket_id)
    {
        try{
            $ticket = Ticket::findorFail($ticket_id);
            $model = [
            'title' => $request->input('data.attributes.title'),
            'description' => $request->input('data.attributes.description'),
            'status' => $request->input('data.attributes.status'),
            'user_id' => $request->input('data.relationships.author.data.id'),
        ];
        $ticket->update($model);

select * from `tickets` where `tickets`.`id` = '6' limit 1
update `tickets` set `title` = 'Mine Ticket', `tickets`.`updated_at` = '2025-11-04 10:29:40' where `id` = 6
---
    public function update(UpdateTicketRequest $request, $ticket_id)
    {
        try{
            $ticket = Ticket::findorFail($ticket_id);
            $validatedData = $request->validated();
            $model = [];

            if (isset($validatedData['data']['attributes'])) {
                $attributes = $validatedData['data']['attributes'];

                if (isset($attributes['title'])) {
                    $model['title'] = $attributes['title'];
                }
                if (isset($attributes['description'])) {
                    $model['description'] = $attributes['description'];
                }
                if (isset($attributes['status'])) {
                    $model['status'] = $attributes['status'];
                }
            }

            if ($request->input('data.relationships.author.data.id')) {
                $model['user_id'] = $request->input('data.relationships.author.data.id');
            }
            if (!empty($model)) {
                $ticket->update($model);

select * from `tickets` where `tickets`.`id` = '36' limit 1
delete from `tickets` where `id` = 36
---
    public function destroy($ticket_id)
    {
        try{
            $ticket = Ticket::findorFail($ticket_id);
            $ticket->delete();